[
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436968622280698",
    "content": "https://www.dailysignal.com/2025/10/22/trumps-middle-east-triumph-embarrassed-self-proclaimed-experts/",
    "media_url": null,
    "timestamp": 1761428340,
    "date_str": "Oct 26, 2025 • 5:39 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436967550742005",
    "content": "https://www.foxnews.com/opinion/new-high-tech-tool-trump-using-secure-our-border",
    "media_url": null,
    "timestamp": 1761428280,
    "date_str": "Oct 26, 2025 • 5:38 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436966353094571",
    "content": "https://www.foxnews.com/politics/scoop-trumps-memphis-crime-crackdown-locates-dozens-missing-kids-removes-109-gangbangers-from-streets",
    "media_url": null,
    "timestamp": 1761428280,
    "date_str": "Oct 26, 2025 • 5:38 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436965402016084",
    "content": "https://dailycaller.com/2025/10/22/jeff-merkley-floor-speech-government-shutdown/",
    "media_url": null,
    "timestamp": 1761428280,
    "date_str": "Oct 26, 2025 • 5:38 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436964513421181",
    "content": "https://www.foxnews.com/us/new-york-city-ice-raid-nets-9-arrests-illegal-aliens-from-west-africa-4-protesters-also-arrested",
    "media_url": null,
    "timestamp": 1761428280,
    "date_str": "Oct 26, 2025 • 5:38 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436964139389799",
    "content": "https://justthenews.com/government/security/deadly-serious-trump-counterterrorism-program-kills-370-jihadists-9-months",
    "media_url": null,
    "timestamp": 1761428280,
    "date_str": "Oct 26, 2025 • 5:38 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436697060819133",
    "content": "Canada was caught, red handed, putting up a fraudulent advertisement on Ronald Reagan’s Speech on Tariffs. The Reagan Foundation said that they, “created an ad campaign using selective audio and video of President Ronald Reagan. The ad misrepresents the Presidential Radio Address,” and “did not seek nor receive permission to use and edit the remarks. The Ronald Reagan Presidential Foundation and Institute is reviewing its legal options in this matter.” The sole purpose of this FRAUD was Canada’s hope that the United States Supreme Court will come to their “rescue” on Tariffs that they have used for years to hurt the United States. Now the United States is able to defend itself against high and overbearing Canadian Tariffs (and those from the rest of the World as well!). Ronald Reagan LOVED Tariffs for purposes of National Security and the Economy, but Canada said he didn’t! Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD. Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10% over and above what they are paying now. Thank you for your attention to this matter!",
    "media_url": null,
    "timestamp": 1761424200,
    "date_str": "Oct 26, 2025 • 4:30 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436558661444946",
    "content": "We have a very strong PEACE in the Middle East, and I believe it has a good chance of being EVERLASTING. Hamas is going to have to start returning the bodies of the deceased hostages, including two Americans, quickly, or the other Countries involved in this GREAT PEACE will take action. Some of the bodies are hard to reach, but others they can return now and, for some reason, they are not. Perhaps it has to do with their disarming, but when I said, “Both sides would be treated fairly,” that only applies if they comply with their obligations. Let’s see what they do over the next 48 hours. I am watching this very closely.",
    "media_url": null,
    "timestamp": 1761422040,
    "date_str": "Oct 26, 2025 • 3:54 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436250208272425",
    "content": "https://www.cnbc.com/2025/10/23/stock-market-today-live-updates.html",
    "media_url": null,
    "timestamp": 1761417360,
    "date_str": "Oct 26, 2025 • 2:36 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115436151669143136",
    "content": "Congressman Jimmy Patronis is a MAGA Warrior who is doing a fantastic job representing Florida’s 1st Congressional District! A Fourth Generation Floridian from the beautiful Panhandle, and owner of an iconic seafood restaurant, Jimmy served as the Chief Financial Officer for the Great State of Florida for seven years, prior to becoming a very distinguished Congressman. In the U.S. House of Representatives, Jimmy is fighting tirelessly to Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Unleash American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Strengthen our Incredible Military/Veterans, and Defend our always under siege Second Amendment. Jimmy Patronis has my Complete and Total Endorsement for Re-Election – HE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761415860,
    "date_str": "Oct 26, 2025 • 2:11 AM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115435567269756205",
    "content": "Richard Hudson is a Great Man, and TREMENDOUS Congressman, who is doing an outstanding job representing the wonderful people of North Carolina’s 9th Congressional District. As Chairman of the National Republican Congressional Committee (NRCC), Richard is working tirelessly with me to help elect smart, tough, and 100% America First Patriots. Together, we won the 2024 Elections down ballot in a LANDSLIDE, and, based on the incredible SUCCESS we are having, are poised to WIN BIG in the 2026 Midterms. In Congress, Richard is fighting hard to Grow the Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Unleash American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Support our Military/Veterans, and Defend our always under siege Second Amendment. Richard Hudson has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761406920,
    "date_str": "Oct 25, 2025 • 11:42 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115435565975811522",
    "content": "Congressman David Rouzer is a terrific Representative for the incredible people of North Carolina’s 7th Congressional District! A Proven Leader, David served as a Highly Respected State Senator and Small Businessman, prior to becoming a very distinguished U.S. Congressman. In Congress, he is fighting tirelessly to Champion our Amazing Farmers and Ranchers, Grow our Economy, Cut Taxes and Regulations, Advance American Energy DOMINANCE, Promote MADE IN THE U.S.A., Keep our now very Secure Border, SECURE, Stop Migrant Crime, Advocate for our Great Military/Veterans, and Protect our always under siege Second Amendment. David Rouzer has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761406920,
    "date_str": "Oct 25, 2025 • 11:42 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115435565492870939",
    "content": "Congressman Addison McDowell is an America First Patriot, who is doing a fantastic job representing North Carolina’s 6th Congressional District! A MAGA Warrior, Addison previously worked for Senator Ted Budd and Congressman Richard Hudson (Two outstanding leaders from the Great State of North Carolina!), prior to becoming a distinguished and Highly Respected Congressman. In Congress, Addison is fighting tirelessly to Champion our Great Farmers and American Agriculture, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Strengthen our Military/Veterans, and Protect our always under siege Second Amendment. Addison McDowell has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761406920,
    "date_str": "Oct 25, 2025 • 11:42 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115435125397678740",
    "content": "Congresswoman Nicole Malliotakis is a Tremendous Champion for New York’s 11th Congressional District! As a Member of the POWERFUL Ways & Means Committee, Nicole knows the America First Policies required to Create GREAT Jobs, Cut Taxes and Regulations, and Champion our Nation’s Golden Age. She is working hard to Advance American Energy DOMINANCE, Promote MADE IN THE U.S.A., Keep our now very Secure Border, SECURE, Strengthen our Brave Military/Veterans, Champion the Incredible NYPD and NYFD, and Protect our always under siege Second Amendment. Nicole Malliotakis has my Complete and Total Endorsement for Re-Election — SHE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761400200,
    "date_str": "Oct 25, 2025 • 9:50 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115434906751111005",
    "content": "Congressman Jack Bergman is a Tremendous Champion for the Great People of Michigan's 1st Congressional District! A retired Lieutenant General of the U.S. Marine Corps, Jack bravely served our Nation in combat, and continues to make our Country proud in Congress. Jack is fighting tirelessly to Champion our Amazing Farmers and Ranchers, Advocate for the Working Men and Women of Michigan, Promote MADE IN THE U.S.A., Cut Taxes and Regulations, Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Strengthen our Military/Veterans, and Defend our always under siege Second Amendment. Jack Bergman has my Complete and Total Endorsement – HE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761396840,
    "date_str": "Oct 25, 2025 • 8:54 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115434876884564053",
    "content": "Congresswoman Lisa McClain is a Fantastic Advocate for the Great People of Michigan’s 9th Congressional District! As the Chair of the House Republican Conference, Lisa is doing a truly fantastic job advancing our America First Agenda. She is working tirelessly to Grow our Economy, Cut Taxes and Regulations, Champion our Great Farmers and American Agriculture, Promote MADE IN THE U.S.A., Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Ensure LAW AND ORDER, Strengthen our Incredible Military/Veterans, and Defend our always under siege Second Amendment. Lisa McClain has my Complete and Total Endorsement for Re-Election — SHE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761396420,
    "date_str": "Oct 25, 2025 • 8:47 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115434875694997684",
    "content": "Greg Steube is a tremendous Representative for the Great People of Florida’s 17th Congressional District! A Former Captain of the U.S. Army JAG Corps, Greg knows the Wisdom and Courage that is required to Defend our Country, Support our Incredible Military/Veterans, and Champion PEACE THROUGH STRENGTH. In Congress, Greg is working hard to Keep our now very Secure Border, SECURE, Stop Migrant Crime, Ensure LAW AND ORDER, Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Champion Small Business, Advance American Energy DOMINANCE, and Defend our always under siege Second Amendment. Greg Steube has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761396360,
    "date_str": "Oct 25, 2025 • 8:46 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115434874266267478",
    "content": "Congressman Mike Haridopolos is an America First Patriot who is doing a fantastic job representing Florida’s 8th Congressional District! A former Teacher, successful Businessman, and now, as U.S. Congressman, Mike has strongly served his Community with a career “loaded up” with accolades and wins. In Congress, he is fighting tirelessly to Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Champion American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Strengthen our Military/Veterans, and Defend our always under siege Second Amendment. Mike Haridopolos has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761396360,
    "date_str": "Oct 25, 2025 • 8:46 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115434873038322093",
    "content": "Congressman Randy Fine is a MAGA Warrior who is doing a fantastic job representing Florida’s 6th Congressional District! A Harvard Educated and Successful Businessman, Randy was a Highly Respected State Legislator, prior to becoming a distinguished U.S. Congressman. He loves the Great People of the Sunshine State, which I won THREE TIMES in 2016, 2020, and 2024! In Congress, Randy is fighting tirelessly to Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Champion our Military/Veterans, Defend our always under siege Second Amendment, and Restore PEACE THROUGH STRENGTH. Randy Fine has my Complete and Total Endorsement – HE WILL NOT LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761396360,
    "date_str": "Oct 25, 2025 • 8:46 PM"
  },
  {
    "truth_social_link": "https://truthsocial.com/@realDonaldTrump/115434871867209348",
    "content": "Congressman Randy Fine is a MAGA Warrior who is doing a fantastic job representing Florida’s 6th Congressional District! A Harvard Educated and Successful Businessman, Randy was a Highly Respected State Legislator, prior to becoming a distinguished U.S. Congressman. He loves the Great People of the Sunshine State, which I won THREE TIMES in 2016, 2020, and 2024! In Congress, Randy is fighting tirelessly to Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Champion our Military/Veterans, Defend our always under siege Second Amendment, and Restore PEACE THROUGH STRENGTH. Randy Fine has my Complete and Total Endorsement – HE WILL NOT LET YOU DOWN!",
    "media_url": null,
    "timestamp": 1761396360,
    "date_str": "Oct 25, 2025 • 8:46 PM"
  }
]